title: PowerShell Spawned from Winword.exe
id: a26adeb1-b7ca-459a-80a2-1011616ffa4a
description: Detects the execution of PowerShell from within Winword.exe, which may indicate exploitation of CVE-2017-0199.
status: stable
author: Flashpoint
date: 2024-08-26
tags:
  - attack.t1203
  - attack.execution_powershell
  - attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
      - '*\powershell.exe'
      -
    ParentImage:
      - '*\winword.exe'
  condition: selection
fields:
  - Image
  - ParentImage
  - CommandLine
  - UserName
  - ProcessId
  - ParentProcessId
falsepositives:
  - Legitimate use cases where PowerShell is used in conjunction with Office macros for legitimate purposes
  - Custom applications that might use PowerShell within Office products for automated tasks
level: high
