title: Detect PowerShell with -windowstyle hidden and Payload retrieval
id: bab87162-e9ca-4b73-8872-4ff95136a5cf 
description: Detects PowerShell with `-windowstyle hidden` and use `New-Object System.Net.WebClient`.
status: stable
author: Flashpoint
date: 2024-08-26
tags:
  - attack.t1564.003
  - attack.t1105
  - attack.defense_evasion
  - attack.command_and_control
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image:
      - '*\cmd.exe'
    CommandLine|contains:
      - '-windowstyle'
      - 'hidden'
      - 'New-Object System.Net.WebClient'
      - 'http'
      - 'powershell"
  condition: selection
falsepositives:
  - Administrative tasks executed with hidden windows
level: high

