title: Detect svchost.exe Spawning cmd.exe with systeminfo or tasklist
id: 1d6f9b4d-68a4-4a72-bf7a-9bda7cb7d9e4
description: Detects instances Konni enumeration commands.
status: stable
author: Flashpoint
date: 2024-08-26
tags:
  - attack.t1057
  - attack.t1082
  - attack.discover
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage:
      - '*\svchost.exe'
    Image:
      - '*\cmd.exe'
    CommandLine|contains:
      - '/c systeminfo' or
      - '/c tasklist'
  condition: selection
falsepositives:
  - Legitimate services which execute enumeration commands
level: low
